src/cf/InformationRegisters/ИдентификаторыОбъектовВСервисахВнешнегоПодписания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИдентификаторыОбъектовВСервисахВнешнегоПодписания</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сервис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СервисыВнешнегоПодписания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СопоставляемыеОбъектыВнешнегоПодписания</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/РаботаСВнешнимПодписаниемКлиент/Ext/Module.bsl
// @strict-types


#Область СлужебныйПрограммныйИнтерфейс

// Открывает форму записи регистра, где хранится идентификатор, если записи нет, открывает форму новой записи.
// 
// Параметры:
//  Объект - СправочникСсылка.Организации, СправочникСсылка.ФизическиеЛица -
//
Процедура СопоставлениеОбъекта(Объект) Экспорт
	
	ОткрытьФорму("РегистрСведений.ИдентификаторыОбъектовВСервисахВнешнегоПодписания.ФормаЗаписи",
		ПараметрыФормыЗаписиИдентификаторыОбъектов(Объект));
	
КонецПроцедуры

// Проверить подключенине к сервису кабинет сотрудника.
// 
// Параметры:
//  Форма                - ФормаКлиентскогоПриложения
//  АдресПриложения      - Строка - Адрес приложения
//  ИдентификаторКлиента - Строка - Идентификатор клиента
//  СекретКлиента        - Строка - Секрет клиента
//
Процедура НачатьПроверкуПодключенияКСервисуКабинетСотрудника(Форма, АдресПриложения, ИдентификаторКлиента, СекретКлиента) Экспорт
	
	ПодключениеУстановлено = РаботаСВнешнимПодписаниемВызовСервера.ПроверитьПодключениеКСервисуКабинетСотрудника(
		АдресПриложения,
		ИдентификаторКлиента,
		СекретКлиента);
	
	Если ПодключениеУстановлено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Подключение установлено успешно'"));
		Возврат;
	КонецЕсли;
	
	ПоказатьПредупреждение(, НСтр("ru = 'Подключение не установлено, проверьте корректность указанных данных.'"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Параметры формы записи идентификаторы объектов.
// 
// Параметры:
//  Объект - СправочникСсылка.Организации, СправочникСсылка.ФизическиеЛица -
// 
// Возвращаемое значение:
//  Структура
//
Функция ПараметрыФормыЗаписиИдентификаторыОбъектов(Объект)
	
	ЗначенияКлюча = Новый Структура;
	ЗначенияКлюча.Вставить("Сервис", ПредопределенноеЗначение("Справочник.СервисыВнешнегоПодписания.КабинетСотрудника"));
	ЗначенияКлюча.Вставить("Объект", Объект);
	
	КлючЗаписи = КлючЗаписиРегистраИдентификаторов(ЗначенияКлюча);
	
	ПараметрыФормы = Новый Структура;
	
	Если КлючЗаписи = Неопределено Тогда
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияКлюча);
		Возврат ПараметрыФормы;
	КонецЕсли;
	
	ПараметрыФормы.Вставить("Ключ", КлючЗаписи);
	Возврат ПараметрыФормы;
	
КонецФункции

Функция КлючЗаписиРегистраИдентификаторов(ЗначенияКлюча)
	
	Возврат РаботаСВнешнимПодписаниемВызовСервера.ПолучитьКлючЗаписиРегистраИдентификаторов(ЗначенияКлюча);
	
КонецФункции

#КонецОбласти
